static
av
cold
int
init
AVCodecContext
*
avctx
ctx
=
-
>
priv
data
struct
context
&
status
ret
h264
initialized
0
if
!
ff
decoder
pix
fmts
<
7
10
else
memset
sizeof
width
height
format
use
sync
decoding
1
ref
buffer
fmt
get
codec
switch
case
AV
PIX
FMT
:
type
break
YUV420P
default
log
LOG
ERROR
Unsupported
pixel
%
d
n
goto
failed
create
extradata
size
!=
Failed
to
hwaccel
FF
API
GET
BUFFER
NULL
endif
open
H
return
close
void
v4l2
free
opaque
uint8
t
unused
s
buf
atomic
sub
refcount
==
memory
order
rel
load
post
unref
wav
header
AVFormatContext
AVIOContext
pb
big
endian
id
uint64
bitrate
14
avpriv
request
sample
AVERROR
INVALIDDATA
AVMEDIA
TYPE
AUDIO
avio
rl16
channels
rate
rl32
block
align
rb16
rb32
bits
per
coded
8
tag
>=
18
report
missing
feature
support
for
files
PATCHWELCOME
-=
FFMIN
22
parse
freep
ENOMEM
skip
32
nb
streams
i
4
RL16
+
RL32
12
20
++
+=
17
INT
MAX
error
recognition
EF
The
PRIu64
is
too
large
WARNING
bit
<=
Invalid
CODEC
ID
AAC
ADPCM
/
write
cl
mem
dst
src
mapped
gpu
env
command
queue
MAP
WRITE
SUCCESS
Could
not
map
EXTERNAL
memcpy
unmap
read
atom
AVStream
st
video
offsets
count
malloc
dlog
offset
x
r
frame
num
duration
rescale
q
AVRational
den
time
base
PRId64
decode
got
AVPacket
avpkt
gbc
AVFrame
bytestream2
bytes
left
128
small
le32
MKTAG
D
S
||
flags
image
check
dx
FFALIGN
BLOCK
W
pitch
depth
VERBOSE
compressed
tex
ratio
slice
clip
thread
decompress
bpp
PAL8
y
16
2
3
24
palette
has
changed
val
byte
0xF
linesize
256
copy
plane
NONE
run
pict
PICTURE
I
key
line
LOCAL
ALIGNED
SRC
SIZE
WIDTH
new
w
func
ptrdiff
const
max
/=
buffers
call
memcmp
fail
filter
mirror
setup
Error
errp
FILTER
chr
qemu
find
set
CLASS
DEVICE
NOT
FOUND
Device
found
fe
out
test
bus
char
g
strdup
printf
machine
?
global
LPC
false
args
qtest
start
irq
in
qpci
pc
dev
device
0x1f
0x00
assert
enable
config
writel
IO
BASE
ADDR
|
0x1
writeb
ACPI
CTRL
0x80
io
legacy
inline
int64
a
b
AVDictionary
m
dict
FATAL
exit
xen
connect
xendev
container
of
state
QemuOpts
rings
malloc0
str
ring
local
port
u
event
channel
PROT
READ
ORDER
domain
refs
XEN
bh
fcntl
fd
F
FD
bind
pv
handler
model
be
path
v9fs
register
transport
opts
opt
add
realize
common
nbd
refresh
filename
BlockDriverState
bs
QDict
options
qdict
QObject
saddr
Visitor
ov
host
SOCKET
ADDRESS
KIND
INET
inet
ipv6
unix
put
driver
qstring
from
export
snprintf
exact
socket
qobject
output
visitor
visit
SocketAddress
abort
complete
QTYPE
obj
server
tls
creds
full
net
tap
name
vlan
ifname
no
interface
fw
cfg
callback
uint16
len
arch
FW
CFG
ARCH
CHANNEL
&=
ENTRY
MASK
entries
coeff
scantable
VLC
vlc
sign
idx
pt
6
ct
64
null
--
gb
vlc2
table
9
11
vp56
bias
bits1
*=
dequant
ac
index
pos
groups
handshake
VncState
vs
gnutls
session
VNC
DEBUG
csock
strerror
vnc
client
vd
validate
done
TLS
mode
next
pts
NOPTS
VALUE
remaining
delay
samples
qcow2
backing
file
cluster
DEFAULT
CLUSTER
version
err
ROUND
UP
del
OPT
BDRV
SECTOR
BACKING
FILE
FORMAT
setg
and
are
EINVAL
finish
bool
propagate
qapi
enum
lookup
MODE
OFF
|=
FLAG
cannot
used
at
the
same
refcounts
only
supported
with
level
above
compat
or
quantize
blk
ch
AC3
BLOCKS
blocks
cnt
ptr
fixed
coef
exp
shift
coefs
emulated
push
card
code
p
dma
cb
dbs
addr
cur
trace
acb
sector
iov
512
sg
while
as
dir
iovec
wait
cpu
continue
after
discard
back
long
do
CPUPPCState
target
sc
sr
ulong
sigset
gpr
lock
user
VERIFY
sigsegv
defined
TARGET
PPC64
sig
internal
sigmask
regs
restore
unlock
QEMU
force
virtio
QEMUFile
f
simple
res
uint32
be32
new0
be64
stride
hwaddr
physical
QTAILQ
INSERT
HEAD
vmstate
conf
outputs
ds
dpy
replace
surface
con
update
cursor
iv
alloc
frames
luma
chroma
pixels
unsigned
bufsize
h
uv
mov
track
tell
wb32
ffio
enc
VIDEO
SUBTITLE
e
c
MOV
packet
props
side
float
dsp
ppc
HAVE
ALTIVEC
CPU
vector
fmul
altivec
reverse
window
AVFilterLink
inlink
AVFilterContext
lut
desc
descriptors
min
comp
log2
var
values
VAR
Y
U
V
A
255
yuv
rgb
rgba
R
G
B
RGB24
BGR24
step
components
double
expr
names
parsing
component
eval
value
int16
end
last
j
k
l
region
select
huff
sb
v
5
0x0f
15
RENAME
l3
INFO
helper
PowerPCCPU
slb
tlb
flush
nip
msr
CPUState
cs
1ULL
MSR
store
OP
dump
interrupt
INTERRUPT
subframe
pred
part
blocksize
lpc
precision
rc
params
rice
residual
uninit
hwctx
acpi
tables
expected
aml
array
signature
tmp
true
fprintf
stderr
Warning
mismatch
string
matroska
lace
mallocz
temp
total
EOF
0xff
0x2
0x3
uint
picture
segment
sequence
rle
bitmap
bytestream
be16
dimensions
than
fast
info
apic
Monitor
mon
kvm
irqchip
kernel
split
pad
inputs
insert
spapr
ram
cmdline
initrd
boot
phb
MemoryRegion
sysmem
system
rma
limit
rtas
le
msi
QLIST
INIT
kvmppc
hw
Unable
enabled
MIN
0x80000000
RTAS
fdt
FDT
htab
icp
smp
cpus
threads
IRQ
PowerPC
definition
tb
mask
reset
subregion
BIOS
bin
targphys
could
0x
lx
events
vio
SERIAL
serial
hds
nvram
pci
SPAPR
PCI
MSI
nd
strcmp
nic
nofail
drive
IF
SCSI
vga
usb
ohci
mouse
guest
elf
translate
address
MACHINE
KERNEL
LOAD
0xffff
initial
disk
bios
NAME
entry
point
0x100
savevm
live
handlers
ide
IDEState
kind
IDE
0x14
isa
mmio
phys
mr
off
offs
seek
ENOTSUP
SEEK
DATA
errno
udp
integer
42
fs
root
AVIO
EIO
field
cmd
int32
datalen
lun
DPRINTF
current
req
scsi
ti
ESP
STAT
counter
DO
INTR
BS
esp
raise
hotplug
DeviceState
DeviceClass
dc
slot
dimm
send
MEMORY
STATUS
cache
SHIFT
XC
PAGE
paddr
valid
mapping
vaddr
nr
buckets
NBD
TRACE
fix
clusters
BDRVQcowState
sn
try
errors
inc
l1
CHECK
snapshots
aio
AioContext
timer
SR
CR
ptimer
lm32
access
unknown
plx
handle
submit
bdrv
unplug
mpeg1
s1
MpegEncContext
mpeg
aspect
mpeg2
allocated
MPV
25
FRAME
tab
intra
matrix
ifdef
dprintf
present
idct
permutation
inter
non
progressive
structure
PICT
dct
short
consumed
Too
input
need
filters
merge
apply
60
synth
save
ibm
change
token
rets
ld
ldq
seq
intr
irqs
PCIDevice
pdev
MSIX
OUT
PARAM
hash
first
msix
remove
vectors
retry
Cannot
allocate
cirrus
vram
blt
invalidate
ext
EXT
extension
extended
pread
magic
QCOW2
MAGIC
END
PRIu32
FEATURE
TABLE
HEADER
cflags
crypt
method
QCOW
but
length
O
NO
QCRYPTO
qcrypto
hdr
listener
space
fr
dirty
RANGE
MemoryRegionSection
section
within
int128
readonly
sigframe
abi
badframe
WORDS
SIG
tcg
match
TCG
I32
vhost
needs
vring
VirtIODevice
vdev
VIRTIO
VERSION
IS
HOST
BIGENDIAN
qxl
render
group
define
debug
QXL
FUNCTION
SET
mutex
ssd
position
schedule
drc
DR
STATE
release
detach
gdb
va
list
i64
ifndef
CONFIG
USER
ONLY
vm
stop
EXCP
arg
bad
PRIx64
Bad
EXIT
tile
compno
reslevelno
bandno
t1
codsty
reslevel
band
coord
prec
cblk
omap
mpu
clk
iomemtype
virt
build
linker
cleanup
gen
DisasContext
opc
rt
rd
opn
ldst
OPC
opcode
0x7
op
T0
GEN
REG
TN
hflags
MIPS
HFLAG
INVAL
generate
exception
RI
uart
rx
accept
UART
response
msg
resp
buflen
USB
RET
SwsContext
sws
class
defaults
i2c
audio
AUD
No
slave
MP
action
qmp
STOP
RUN
RAM
SysBusDevice
this
1024
qdev
sysbus
lsi
ics
SCSIDiskState
UPCAST
SENSE
aiocb
DMA
BUF
external
qiov
readv
MachineState
DriveInfo
dinfo
flash
generic
sdram
pflash
by
0x01
pic
gpio
main
object
property
Object
raw
half
src1
src2
initfn
exec
l2
old
OFLAG
FOREACH
flight
on
available
make
DCTELEM
T1
xer
ca
likely
readl
08x
fault
configuration
avcodec
invalid
media
subtitle
capabilities
CAP
DELAY
pkt
TIME
Q
rects
display
ms
1000
decoded
text
option
elems
descriptor
PROP
number
mp
inbuf
layer
pcm
src8
CHANNELS
PCM
DECODE
le16
0x8000
le64
unsupported
ape
BusState
qbus
parent
BUS
alignment
vq
dstStride
x86
reg
TEMPLATE
MMX
asm
volatile
xor
PREFETCH
movq
mm0
mm2
mm1
punpcklbw
punpckhbw
mm3
mm5
mm4
mm6
YUYV
MOVNTQ
$
cmp
1b
FAST
yc
uc
vc
initialize
function
control
THREAD
vec
element
i32
TCGv
dest
memop
MO
reached
pa
UNSPECIFIED
iommu
PCIBus
devfn
VTD
OBJECT
ops
vmdk
extent
begin
sectors
dec
move
pr
t0
DIS
logfile
op1
op2
cris
cc
PR
CC
sizes
balloon
ObjectClass
klass
vendor
VENDOR
revision
alias
properties
active
ports
connected
ns
CLOCK
VIRTUAL
elem
be32s
virtqueue
throttle
mod
HELPER
float32
flag
compare
fp
CF
29
argc
argv
pattern
C
P
atoi
optarg
usage
optind
argument
aligned
writev
buf0
buf1
ubuf0
ubuf1
dstW
uvalpha
OFFSET
BP
REGBP
pop
ROM
inserted
CODE
REQ
READY
04x
single
singlestep
0x0
watchpoint
breakpoint
MEM
ACCESS
sw
stdio
backend
signal
job
QERR
node
acquire
blocker
all
should
enter
LEN
page
pages
xfer
0x10
0x02
pstrcpy
movl
npc
aac
search
tns
sce
profile
PROFILE
freq
samplerate
0f
windows
FFMAX
conv
swb
calc
PRED
filt
process
coeffs
ltp
caps
right
now
assert0
rdma
RDMA
CONTROL
REGISTER
repeat
head
result
PER
recv
many
requests
message
wr
curr
compress
zero
chunk
REQUEST
requested
pin
migration
remote
chunks
CHUNK
keys
perror
Unknown
vc1
inv
trans
8x8
cm
flat
PATH
sscanf
RW
qerror
restart
needed
interval
seg
AVDISCARD
ALL
finished
url
segments
100
sec
swf
ByteIOContext
tx
mxf
content
storage
UINT
private
bitstream
slices
pool
surfaces
realloc
frag
fragment
fc
dts
distance
stream
ctts
keyframe
0x200
transform
TO
63
REMOVE
vdi
bmap
logout
print
round
up
uuid
link
migrate
BRIDGE
bridge
vmsd
yuv2rgb
dstFormat
cy
31
36
div
x0
x1
0xffffffff
DIV
ZERO
direntry
directory
tail
0x20
DIR
msa
avc
hv
Picture
mb
SKIP
MB
2d
qscale
INTRA
LIST
X
GetBitContext
FIXME
motion
h263
json
bt
fifo
hci
BITS
BLK
DIRTY
esc
diff
127
AC
ENC
INDEX
obt
nchannels
period
FUNC
dolog
readb
readw
compute
bnd
bands
STATIC
ac3
sum
mdct
sd
z
zstream
previous
Z
tight
compression
LEVEL
OK
avail
SYNC
FLUSH
poutbuf
fpc
headers
USE
TS
best
child
low
score
penalty
buffered
int8
wrap
codes
NEW
dyn
COPY
LE
symbol
H264Context
prev
poc
msb
lsb
PIC
COUNT
sbd
SYS
rom
prom
ehci
bps
NB
19
partition
cols
rows
assign
mv
nnz
undef
smk
eof
sz
pal
r8
0x40
bufs
prop
CharDriverState
cmsg
listen
def
fill
PPC
pvr
insns
insn
02x
opc1
opc2
0xFF
ALIGN
s390
S390CPU
word
KVM
S390
ioport
pxa2xx
HAS
GPIO
dat
fg
OutputStream
ost
layouts
avfilter
graph
AUTO
layout
volume
vol
unregister
endptr
param
vser
console
already
range
specified
allowed
TAIL
notify
mmu
CPUX86State
self
down
nc
peer
pwrite
QEMUIOVector
flags2
mix
loop
timeout
ioh
tv
poll
slirp
iothread
alarm
running
timers
TIMER
clock
rv34
b8
dmv
svq3
se
golomb
mc
progress
can
macroblock
MC
rcc
PI
E
eq
stats
strchr
rce
misc
icount
parser
RC
xvid
term
30
gop
q2d
mmx
mmxext
SCALE
X86
srcFormat
SSE2
sse2
ssse3
outlink
scale
BYTE
fps
timecode
w8
metadata
source
reference
dv
re
scan
partial
UPDATE
CACHE
show
rl
eob
LAST
orig
0x7f
TranslationBlock
saved
arm
unlikely
avformat
ts
strncmp
strlen
PKT
parameter
pps
ue
qp
bd
sps
cabac
minus1
top
bottom
overflow
idc
26
parameters
so
scaling
second
encoding
direct
INPUT
uvlinesize
quality
tce
emu
tcet
PARAMETER
speed
granularity
none
BLOCKDEV
ON
INVALID
Can
co
coroutine
inval
POWERPC
PRIV
ra
rA
imm
it
REGS
lower
before
one
interlaced
pcie
cap
EXP
DEV
fds
native
qov
QDECREF
qiv
decref
fn
started
T
notifier
cancel
async
RESET
ffurl
URLContext
transfer
prot
bar
4096
SPACE
tc
pass
neon
clear
high
w2
wctx
sep
item
START
TEST
qint
unless
wp
TAILQ
pcms
rtc
extra
smbios
IOMMU
an
using
dynamic
devices
pending
pack
replay
EVENT
shutdown
gsi
lp
L2
cond
pwt
OMAP
0x04
0x08
http
proxy
uri
hostname
auth
loc
tcp
hd
filesize
AUTH
rw
MMU
attr
FsContext
jmp
movi
tl
idstr
css
sch
SCSW
FLAGS
ctrl
work
bp
breakpoints
lduw
ENDIAN
STREAM
probe
AVProbeData
M
N
AVPROBE
SCORE
dither
prefix
nal
unit
bc
HEVC
NAL
vps
zeroes
ENOSYS
bulk
ep
endpoint
aurb
arith
arg1
arg2
ofs
edit
scan8
subpacket
avg
SB
sampling
alpha
beta
tc0
p0
p1
q0
q1
FFABS
delta
CPUMIPSState
lj
branch
DISAS
EMPTY
instr
ldl
loglevel
TB
IN
disas
lag
zeros
siv
received
packets
sent
UNKNOWN
ev
disable
uintptr
CMD
PACKET
BM
COMMAND
STS
lba
ACTIVE
cmpint
tracks
partitions
tags
fsize
RB16
0xfff
RB32
13
append
hevc
ARRAY
ELEMS
tf
srcStride
srcW
bgr
0x1F
VP56
rac
unpack
dirac
rtsp
oformat
RTSP
fclose
rdt
rtp
SETUP
mmco
color
er
48
scratch
CPSR
vtd
ir
attrs
FIRST
PRIx32
IR
sid
eip
elif
ARM
PC
ENABLE
pid
TOKEN
28
PIXEL
prediction
algo
lowres
IDCT
PERM
sse
lambda
sf
cost
abs
energy
threshold
dist
book
guess
INT64
timestamp
nut
sp
chapter
secure
CPUARMState
rec
0x0000
dim
cylinders
heads
secs
empty
blockdev
features
geometry
written
cid
ids
SDL
scr
real
grab
sdl
cq
platform
bm
cr
encode
planar
encoded
inited
kbd
COLOR
resize
TCGContext
dead
temps
oi
have
CALL
ARG
mul
addr1
40
PADDING
swr
buf2
convert
CH
chip
SLOT
OUTPUT
instance
float64
aSign
aExp
aSig
sockaddr
addrlen
graphic
dcl
label
t2
andi
sar
spr
SPR
brcondi
COND
EQ
predictor
80
compatible
fragments
coding
DC
counts
L1
FULL
AREG0
offsetof
sregs
A0
EDX
eflags
EXEC
CS
SS
VM
segs
r1
r2
r3
sccb
pbdev
fid
USBDevice
product
auto
attach
priority
mbaff
bS
c0
gic
NUM
GIC
R0
reserved
vid
snapshot
rsp
SD
TAG
proto
ver
RES
ENOENT
ka
sa
NR
ahci
AHCI
BIT
cert
sock
pd
SOFT
strcpy
reader
WIN32
watch
FALSE
htonl
netdev
NetClientState
vnet
queues
script
NET
CLIENT
monitor
NONBLOCK
does
br
vfio
intp
vbasedev
VFIO
commit
ebml
ftell
DESC
L
o
33
vmxnet3
descr
cell
VMXNET3
TX
excp
0x00000000
RGB
AVPicture
clamped
sbr
master
subband
fft
stereo
phase
alt
frequency
payload
resync
marker
signed
INSN
p2
vorbis
avccontext
SAMPLE
kqemu
query
mjpeg
quant
ls
DECODER
ssize
pdu
V9fsString
illegal
ifm
again
mips
sdp
strstart
asf
vp
pictq
screen
vf
vertical
b0
b1
b2
iomem
0x1000
RDWR
ioctl
receive
c1
feed
ffm
SEND
EAGAIN
EINTR
sys
board
macaddr
delete
multi
qcow
must
encrypted
AVFilterBufferRef
mkv
title
extract
si
di
skipped
v1
strip
codebook
ap
ast
mmap
STEREO
hint
ranges
overlap
fourxm
fseek
CUR
stat
50
movd
mm7
pxor
mm
por
pand
psrlw
paddw
ccw
vqs
QUEUE
signo
niov
outbuf
nvdimm
GArray
tp
sin
ip
tm
prepare
protocol
iova
ce
typename
piix3
bmds
mig
password
cpe
parity
ivi
planes
film
numa
VHOST
IDX
border
ARITH
acct
my
bootsector
fat
pointer
0x3f
iformat
pcr
codecpar
reading
incr
1000000
u8
u16
u32
S16
colors
DISABLE
DEPRECATION
WARNINGS
rect
tpm
ISA
disabled
primary
conn
colo
th
checksum
pixels16
x2
y2
rnd
SLICE
pthread
ab
ERR
H264
GRAY
ER
MV
states
BUG
td
row
FIELD
OR
destroy
img
f1
pipe
fopen
PGM
m4ac
lfe
comment
program
bx
GUEST
sel
bitbuf
svq1
pmv
cpuid
eax
ebx
ecx
edx
std
family
0xf
23
sl
pes
au
padding
inst
acc
types
vseq
fields
l0
spatial
chan
hwdef
linux
DEVS
tick
stl
VGA
parallel
fdctrl
NVRAM
tmp0
cipher
hdev
regions
ctl
AIO
fpu
CP0
FP
BlockBackend
encoder
meta
snow
horizontal
compose
minor
par
PTR
perms
edge
VALID
EDGE
reordered
required
oc
realized
FAILED
other
mcast
iter
rtl8139
PRINT
raddr
0x40000000
FLOAT
ioreq
pio
bounce
sdev
megasas
reply
hnm
phdr
service
core
SERVER
mms
incoming
credp
uid
gid
ss
addi
unlink
peek
setprop
style
lim
fb
memmove
rcu
lumSrc
chrSrc
uDest
chrDstW
vr
times
temp2
chardev
pp
gain
ctxt
qlist
crc
CSR
STORE
asi
hi
lo
sasl
mp3
TCGReg
PT
LONG
busdev
FLASH
eth
cp
vcpu
PORT
linear
TLB
addend
ist
ticks
sei
MATROSKA
AVFMT
date
cues
IP
selector
CPUS390XState
tuc
stack
PSW
OPCODE
psw
iscsi
iscsilun
task
csum
HDR
stw
0xFFFF
gd
area
gtk
inner
Y1
mant
noise
Y2
pe
HF
cpl
FEAT
tmp1
tmp2
NEXT
im
js
sconf
always
hash64
pte
dr
pte0
pte1
HPTE64
SAMPLES
blockalign
vfree
PARSE
dt
stq
qed
pnum
sphb
EN
jpeg
fidp
stbuf
pit
REGION
mac
col
FFSWAP
pulse
strlcpy
ST
framerate
glob
dup
was
2048
hpet
HPET
RTC
xhci
intx
spec
avs
PALETTE
backup
me
below
limits
TIFF
slotid
MMX2
DXVA2
colorspace
AVCOL
dpl
e1
e2
EXCP0D
GPF
0xfffc
ETH
imdct
setting
strict
bypass
i8259
0x10000
mux
amf
flv
ioc
FLV
LAYOUT
orientation
execute
BOOKE
ai
ssp
BLKDBG
nodes
AF
SOCK
connection
bandwidth
revents
vsid
tu
cu
sdhci
rb
KEY
HI
clut
cow
src0
out0
out1
out2
v16u8
LD
vp3
interrupts
cells
nofid
P9
less
mh
substr
more
substream
ogg
os
thp
hls
avf
MANGLE
pmaddwd
21
packuswb
paddusb
el
sense
eaddr
bat
FSL
any
s16
GEM
decr
dy
LEFT
lines
rs
extract32
xy
GT
NE
NATIVE
qio
QIO
E1000
vma
y1
packed
ALPHA
increment
bswap
ASYNC
schid
dummy
blob
cin
cmphex
dst1
dst2
lc
ps
mx
epel
rpath
bl
modes
spice
rv
RTP
ic
psrlq
slots
nfs
qid
CORE
openpic
iotlb
perm
CONTEXT
note
ll
nan
inode
nsec
snap
MFI
hda
win
HANDLE
uhci
bank
curl
iTask
power
tr
final
opp
NVME
transferred
rm
framesize
lengths
qbool
draw
glyph
tree
dp
v7m
PTE
pfd
words
reopen
overlay
milkymist
factor
eeprom
psllq
v2
TOP
suffix
THROTTLE
iops
size2
SEARCH
weight
denom
units
prob
cat
vp8
MIGRATION
8s
sh
SH
PF
delayed
sym
pm
pre
dmin
ME
qvirtio
ADD
cmos
ABS
negotiate
FIXED
nand
help
binfo
strtol
y0
pu
virtual
getlength
ri
CP
BAR
IMAGE
evt
fadt
BUILD
footer
rbd
resample
avr
frac
PXA2XX
lcd
I2C
tiles
mbs
corr
alac
dst0
PS
quirk
ractx
hist
bw
shared
pred4x4
mcf
slavio
ptem
reason
0x03
tbl
ok
BlockDriver
drv
SDHC
wi
pch
DBDMA
ar
MMCO
proc
nvic
d1
cssid
ssid
capture
sglist
qpel
mmx2
sioc
farg
sqrt
nbits
shri
02d
fpscr
vbi
r0
JPEG2000
t3
t4
biweight
floor
venc
floor1
NOACCESS
ad
VP8
opus
ZPCI
subpage
cbp
adapter
ready
sram
sprite
dstWidth
xInc
formatConvBuffer
xalpha
esi
edi
xx
cx
xpos
ro
xsave
refl
retval
xattr
vert
mqc
INTER
bs1
sect
klv
png
x4
pf
vui
fh
chctx
menu
pty
norm
out32
pteg
completion
ci
superblock
disp
a1
a2
a3
over
v16i8
v8i16
hz
out3
filterSize
bsf
description
primaries
hrd
pde
PG
iso
sysctl
oss
PPC2
org
cbpcy
mquant
pq
route
standard
SVGA
xenfb
a0
b3
xc
rps
mpc8
q2
scaled
curidx
px
RX
formats
postcopy
guid
VHDX
crop
elbg
bi
golden
peak
qh
rv40
SM
x509
MM
PROTOCOL
grp
CPUID
pfn
startcode
che
keycode
schro
smb
pcc
1ull
guidcmp
pktl
drop
en
cases
crm
src3
ctb
dtext
picref
filtered
specific
MAC
vmsvga
syntax
mean
qobj
mch
4g
language
reqs
IPMI
nals
c2
d2
ph
temp1
cp15
CONST
idsp
acl
vmd
rule
bochs
s2
ivshmem
based
dxy
pfl
cfi
font
am
xmax
ymax
mot
framep
trk
tcase
ex
farg1
vmcb
DCA
ROCKER
sm
ea
xmm0
xmm2
xmm4
xmm1
vst
uvsrc
sdr
hp
reg2
tokstart
TD
pls
MFX
indx
decorr
outpicref
enccfg
thresh
nvenc
CNT
gregs
h1
keysym
blkdev
DEMUXER
fis
icc
prd
filter16y
filter8uv
mspel
reg1
tlen
avi
ncq
curframe
vms
movie
ALLOCZ
GOTO
epctx
po
tfs
dca
fl
reftable
scf
OHCI
fbdev
mseq
BONITO
